<?php
            $regexFirstName = "#^([A-Za-zéèàîôêâûŷäëïöüÿùç]){2,17}[-]?([A-Za-zéèàîôêâûŷäëïöüÿù]){0,17}$#";
            $regexLastName = "#^([A-Za-zéèàîôêâûŷäëïöüÿùç]){2,17}([ ]([A-Za-zéèàîôêâûŷäëïöüÿù]){0,10}){0,5}$#";
            $regexBirthday = "#^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]))\g1|(?:(?:29|30)(\/|-|\.)(?:0?[13-9]|1[0-2])\g2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)0?2\g3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9])|(?:1[0-2]))\g4(?:(?:1[6-9]|[2-9]\d)?\d{2})$#";
            $regexAddress = "#^([1-9]|[1-9][0-9]|[1-9][0-9]{2}|1[0-9]{3})[A|a|b|B]?[ ]?(bis)?[- ](avenue|Avenue|AVENUE|rue|Rue|RUE|Boulevard|BOULEVARD|boulevard|Impasse|IMPASSE|impasse|Allée|ALLEE|allée|hameau|Hameau|HAMEAU|Chemin|chemin|CHEMIN|lieu-dit|Lieu-dit|LIEU-DIT|lieu-Dit|Lieu-Dit)[- ][A-Za-zéèàâêŷûîôäëïöüÿùç]+([- ]?[A-Za-zéèàâêŷûîôäëïöüÿùç]{0,17}){0,3}$#";
            $regexPostal = "#^((0[1-9]|[1-8][0-9]|9[0-5])[0-9]{3})|97[1-6]$#";
            $regexCity = "#^[A-Za-zéèàâêŷûîôäëïöüÿùç]+([- ]?[A-Za-zéèàâêŷûîôäëïöüÿùç]{0,17}){0,10}$#";
            $regexMail = "#^\w+([.-]?\w+)@\w+([.-]?\w+)(.\w{2,3})+$#";
            $regexPhone = "#^[0][1-9]([-. ]?)(([0-9]{2})\g1([0-9]{2}))(\g1([0-9]{2})){2}|[+]33[0-9]([-. ]?)(([0-9]{2})\g7([0-9]{2}))(\g7([0-9]{2})){2}$#";
            $regexPeNumber = "#^[0-9]{7}[[:alnum:]]$#";
            $regexCodecademy = "#^((https:\/\/www.codecademy.com)|(www.codecademy.com)|(codecademy.com))[\/][A-Za-z0-9]+$#";
?>